<%--
  Created by IntelliJ IDEA.
  User: artem
  Date: 15.01.17
  Time: 23:09
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <title>История Linux в России</title>
    <style>
        <%@ include file="style.css"%>
    </style>
</head>
<body>
<h1>История Linux в России</h1>
<table>
    <tr>
        <td>
            Дистрибутивы разработанные в России, или по крайней мере Российскими разработчиками. На самом деле, дело с
            русскими дистрибутивами обстоит не так уж плохо. Есть несколько компаний разрабатывающих Linux, очень даже
            неплохо и даже с поддержкой государства. Многие российские дистрибутивы завоевали всемирную известность.
            <p></p>
            Все это мы и рассмотрим в сегодняшней статье. Начнем с самых популярных и новых дистрибутивов, и
            постепенно опустимся к менее известным. Но все представленные здесь варианты действительно лучшие
            российские дистрибутивы Linux и заслуживают вашего внимания.
            <p></p>
            Дистрибутив
            <a href="https://www.rosalinux.ru/">ROSA Linux</a> разрабатывается российской компанией НТЦ ИТ РОСА или
            "Научно-технический центр
            информационных технологий "Российские операционные системы", разработка началась в 2007 году и до
            сегодняшнего дня было наработано достаточно много улучшений.
            <p></p>
            Изначально дистрибутив основывался на Mandriva, версия для рабочего стола и версия для сервера основывалась
            на Red Hat. Но после того как Mandriva была закрыта, проект OpenMandriva, был основан именно на Rosa Linux.
            <p></p>
            Это простая в использовании и установке система, предоставляющая большинство необходимого обычному
            пользователю программного обеспечения из коробки. Также вместе с дистрибутивом поставляются все необходимые
            медиа кодеки.
            <p></p>
            Интерфейс системы и оформление окон немного похожи на стиль Windows, а это поможет новым пользователям лучше
            освоится в системе. В качестве оболочки рабочего стола используется KDE.
            <p></p>
            Кроме того разработчики Rosa вносят множество улучшений и исправлений в большинство поставляемых пакетов.
            <p></p>
            <a href="http://www.calculate-linux.ru/">Calculate Linux</a> разрабатывается Александром Тратсевским из
            России. Этот российский дистрибутив Linux основан
            на Gentoo и включает в себя все его преимущества, а также большое количество дополнительных возможностей и
            графический установщик. Разработка проекта началась еще в 2007 году.
            <p></p>
            Особенно хорош Calculate для бизнес среды. Он оптимизирован для быстрого развертывания вы можете настроить
            конфигурацию на одном компьютере и использовать ее на всех других. Пользователь под своей учетной записью
            может использовать систему независимо от компьютера. Последняя версия Calculate - 15.12. В этой версии была
            добавлена возможность создания LiveUSB, добавлена поддержка драйвера AMDGPU с открытым исходным кодом, а
            также многие другие улучшения.
            <p></p>
            Операционная система <a href="https://zorinos.com/">ZorinOS</a> разработана выходцем из России Артемом
            Зорином, который на данный момент
            находится в Ирландии. Это еще один дистрибутив корпоративного класса, очень похожий на Windows. И надо
            сказать, что достаточно популярный, еще одно доказательство, что русские дистрибутивы linux популярны не
            только в России.
            <p></p>
            ZorinOS основана на Ubuntu и использует окружение рабочего стола Gnome 3 и собственную оболочку Zorin DE для
            организации пользовательского интерфейса. Последний стабильный релиз ZorinOS 9 основан на Ubuntu 14.04 LTS,
            а самый свежий - ZorinOS 11 - на Ubuntu 15.10. Особенностью ZorinOS есть собственные темы оформление похожие
            одновременно и на Windows XP и 7, а также утилита для управления темами, позволяющая настроить внешний вид
            рабочего стола.
            <p></p>
            На данный момент ZorinOS поставляется в виде двух основных версий - стабильная 9, и самая новая 11. Обе
            версии имеют редакции Core, Lite, Business и Ultimate. Первые две редакции бесплатны, а две последние
            доступны по цене 8.99 и 9.99 соответственно.
            <p></p>
            Этот русский дистрибутив Linux, наверное, был первым дистрибутивом Linux для многих россиян. Он основан на
            Ubuntu и предлагает улучшенную русскоязычную локализацию. Развитие проекта началось в далеком 2007 году.
            Тогда Алексеем Черноморенко и Александром Бехером для доклада на научной конференции по открытом программном
            обеспечении была подготовлена специальная сборка Ubuntu: Ubuntu Full Power Linux. В дальнейшем эта сборка
            набрала популярность среди пользователей и в сфере образования и была переименована в <a
                href="http://runtu.org/">Runtu</a>.
            <p></p>
            Основная цель этого дистрибутива - предоставить новичкам отлично локализованую и простую систему со всем
            необходимым программным обеспечением из коробки. Кроме того, есть и собственное программное обеспечение,
            например, утилита Runtu Assistant, которая поможет новым пользователям лучше настроить систему.
            <p></p>
            Последний релиз Runtu состоялся в марте 2015 года. Было обновлено программное обеспечение, добавлена
            поддержка 64 бит и внесены некоторые исправления.
            <p></p>
            Дистрибутив <a href="http://www.astralinux.com/">Astra Linux</a> разрабатывается компанией НПО РусБИТех для
            военных целей, силовых структур и ФСБ.
            Дистрибутив акцентирован на защиту данных и используется в различных государственных структурах.
            Поставляется дистрибутив в двух редакциях: Spesial Edition и Common Edition. Общая редакция предназначена
            для предприятий, специальная - для спецслужб.
            <p></p>
            Вместе с системой поставляется множество собственного программного обеспечения. Все приложения,
            разработанные авторами дистрибутива имеют префикс fly. Это fly-fm - файловый менеджер, панель Fly,
            fly-admin-wicd - менеджер сетевых подключений, fly-update-notifier - виджет обновлений, терминал Fly,
            fly-videocamera, fly-record - запись звука, fly-cddvdburner, fly-ocr - распознавание текста и т д. Кстати
            важно заметить что файловый менеджер fly очень напоминает проводник Windows.
            <p></p>
            <a href="http://www.altlinux.ru/">ALT Linux</a> разрабатывается одноименной российской компанией: "Альт
            Линукс". И опять же операционная система
            рассчитана на бизнес сектор. По умолчанию поставляется все необходимое программное обеспечение для офисной
            работы, работы с графикой, обработки звука, видео и программирования.
            <p></p>
            Во время установки можно выбрать компоненты дистрибутива, которые необходимо установить, и таким образом
            сформировать функциональность дистрибутива.
            <p></p>
            По умолчанию русский дистрибутив Linux используется окружение рабочего стола KDE 4. Минимальные системные
            требования 768 мегабайт оперативной памяти, а также видеокарта с поддержкой 3D ускорения. Самая новая на
            данный момент версия Alt Linux - 7.0.5, релиз которой состоялся в начале 2015 года.
        </td>
    </tr>
    <tr>
        <td align="middle">
            Для возврата к "меню" необходимо кликнуть по картинке.<br>
            <a target="_self" href="menu.jsp" class="Growing">
                <img class="Growing" alt="Image not found"
                     src="http://orig04.deviantart.net/6784/f/2007/200/e/b/communist_tux_by_r3b31.jpg"
                     width="300px" height="300px">
            </a>
        </td>
    </tr>
</table>
</body>
</html>
